guanjianhe/feitian3hao/Ex14.5.0_DAC转换的基本应用（1）/Ex14.5.0_DAC转换的基本应用（1）/Ex14.5.0_DAC转换的基本应用/USER/STC15Fxxxx_PWM.H
#ifndef	_STC15Fxxxx_H
#define	_STC15Fxxxx_H
#include <intrins.h>
/*  BYTE Registers  */
sfr P0   = 0x80;
sfr SP   = 0x81;
sfr DPL  = 0x82;
sfr DPH  = 0x83;
sfr	S4CON = 0x84;
sfr	S4BUF = 0x85;
sfr PCON = 0x87;

sfr TCON = 0x88;
sfr TMOD = 0x89;
sfr TL0  = 0x8A;
sfr TL1  = 0x8B;
sfr TH0  = 0x8C;
sfr TH1  = 0x8D;
sfr	AUXR = 0x8E;
sfr WAKE_CLKO = 0x8F;
sfr INT_CLKO = 0x8F;
sfr	AUXR2    = 0x8F;

sfr RL_TL0  = 0x8A;
sfr RL_TL1  = 0x8B;
sfr RL_TH0  = 0x8C;
sfr RL_TH1  = 0x8D;


sfr P1   = 0x90;
sfr P1M1 = 0x91;	//P1M1.n,P1M0.n 	=00--->Standard,	01--->push-pull		实际上1T的都一样
sfr P1M0 = 0x92;	//					=10--->pure input,	11--->open drain
sfr P0M1 = 0x93;	//P0M1.n,P0M0.n 	=00--->Standard,	01--->push-pull
sfr P0M0 = 0x94;	//					=10--->pure input,	11--->open drain
sfr P2M1 = 0x95;	//P2M1.n,P2M0.n 	=00--->Standard,	01--->push-pull
sfr P2M0 = 0x96;	//					=10--->pure input,	11--->open drain
sfr CLK_DIV = 0x97;
sfr PCON2   = 0x97;

sfr SCON  = 0x98;
sfr SBUF  = 0x99;
sfr S2CON = 0x9A;	//
sfr S2BUF = 0x9B;	//
sfr P1ASF = 0x9D;	//只写，模拟输入(AD或LVD)选择

sfr P2    = 0xA0;
sfr BUS_SPEED = 0xA1;
sfr AUXR1 = 0xA2;
sfr P_SW1 = 0xA2;

sfr IE    = 0xA8;
sfr SADDR = 0xA9;
sfr WKTCL = 0xAA;	//唤醒定时器低字节
sfr WKTCH = 0xAB;	//唤醒定时器高字节
sfr	S3CON = 0xAC;
sfr S3BUF = 0xAD;
sfr IE2   = 0xAF;	//STC12C5A60S2系列

sfr P3    = 0xB0;
sfr P3M1  = 0xB1;	//P3M1.n,P3M0.n 	=00--->Standard,	01--->push-pull
sfr P3M0  = 0xB2;	//					=10--->pure input,	11--->open drain
sfr P4M1  = 0xB3;	//P4M1.n,P4M0.n 	=00--->Standard,	01--->push-pull
sfr P4M0  = 0xB4;	//					=10--->pure input,	11--->open drain
sfr IP2   = 0xB5;	//STC12C5A60S2系列
sfr IPH2  = 0xB6;	//STC12C5A60S2系列
sfr IPH   = 0xB7;

sfr IP        = 0xB8;
sfr SADEN     = 0xB9;
sfr	P_SW2     = 0xBA;
sfr ADC_CONTR = 0xBC;	//带AD系列
sfr ADC_RES   = 0xBD;	//带AD系列
sfr ADC_RESL  = 0xBE;	//带AD系列

sfr P4        = 0xC0;
sfr WDT_CONTR = 0xC1;
sfr IAP_DATA  = 0xC2;
sfr IAP_ADDRH = 0xC3;
sfr IAP_ADDRL = 0xC4;
sfr IAP_CMD   = 0xC5;
sfr IAP_TRIG  = 0xC6;
sfr IAP_CONTR = 0xC7;

sfr ISP_DATA  = 0xC2;
sfr ISP_ADDRH = 0xC3;
sfr ISP_ADDRL = 0xC4;
sfr ISP_CMD   = 0xC5;
sfr ISP_TRIG  = 0xC6;
sfr ISP_CONTR = 0xC7;

sfr P5     = 0xC8;	//
sfr P5M1   = 0xC9;	//	P5M1.n,P5M0.n 	=00--->Standard,	01--->push-pull
sfr P5M0   = 0xCA;	//					=10--->pure input,	11--->open drain
sfr P6M1   = 0xCB;	//	P5M1.n,P5M0.n 	=00--->Standard,	01--->push-pull
sfr P6M0   = 0xCC;	//					=10--->pure input,	11--->open drain
sfr SPSTAT = 0xCD;	//
sfr SPCTL  = 0xCE;	//
sfr SPDAT  = 0xCF;	//

sfr PSW  = 0xD0;
sfr	T4T3M = 0xD1;
sfr	T4H  = 0xD2;
sfr	T4L  = 0xD3;
sfr	T3H  = 0xD4;
sfr	T3L  = 0xD5;
sfr	T2H  = 0xD6;
sfr	T2L  = 0xD7;

sfr	TH4  = 0xD2;
sfr	TL4  = 0xD3;
sfr	TH3  = 0xD4;
sfr	TL3  = 0xD5;
sfr	TH2  = 0xD6;
sfr	TL2  = 0xD7;

sfr	RL_T4H  = 0xD2;
sfr	RL_T4L  = 0xD3;
sfr	RL_T3H  = 0xD4;
sfr	RL_T3L  = 0xD5;
sfr	RL_T2H  = 0xD6;
sfr	RL_T2L  = 0xD7;

sfr CCON = 0xD8;	//
sfr CMOD = 0xD9;	//
sfr CCAPM0 = 0xDA;	//PCA模块0的工作模式寄存器。
sfr CCAPM1 = 0xDB;	//PCA模块1的工作模式寄存器。
sfr CCAPM2 = 0xDC;	//PCA模块2的工作模式寄存器。

sfr ACC    = 0xE0;
sfr	P7M1   = 0xE1;
sfr	P7M0   = 0xE2;
sfr	CMPCR1 = 0xE6;
sfr	CMPCR2 = 0xE7;

sfr	P6     = 0xE8;
sfr CL     = 0xE9;	//
sfr CCAP0L = 0xEA;	//PCA模块0的捕捉/比较寄存器低8位。
sfr CCAP1L = 0xEB;	//PCA模块1的捕捉/比较寄存器低8位。
sfr CCAP2L = 0xEC;	//PCA模块2的捕捉/比较寄存器低8位。

sfr B      = 0xF0;
sfr	PWMCFG   = 0xF1;	//PWM配置寄存器
sfr PCA_PWM0 = 0xF2;	//PCA模块0 PWM寄存器。
sfr PCA_PWM1 = 0xF3;	//PCA模块1 PWM寄存器。
sfr PCA_PWM2 = 0xF4;	//PCA模块2 PWM寄存器。
sfr	PWMCR    = 0xF5;	//PWM控制寄存器
sfr	PWMIF    = 0xF6;	//PWM中断标志寄存器
sfr	PWMFDCR  = 0xF7;	//PWM外部异常控制寄存器

sfr	P7     = 0xF8;
sfr CH     = 0xF9;
sfr CCAP0H = 0xFA;		//PCA模块0的捕捉/比较寄存器高8位。
sfr CCAP1H = 0xFB;		//PCA模块1的捕捉/比较寄存器高8位。
sfr CCAP2H = 0xFC;		//PCA模块2的捕捉/比较寄存器高8位。

#define	PWMCH	0xFFF0	/* PWM计数器高字节  */
#define	PWMCL	0xFFF1	/* PWM计数器低字节  */
#define	PWMCKS	0xFFF2	/* PWM时钟选择      */

#define	PWM2T1H	0xFF00	/* PWM2T1计数高字节 */
#define	PWM2T1L	0xFF01	/* PWM2T1计数低字节 */
#define	PWM2T2H	0xFF02	/* PWM2T2计数高字节 */
#define	PWM2T2L	0xFF03	/* PWM2T2计数低字节 */
#define	PWM2CR	0xFF04	/* PWM2控制         */

#define	PWM3T1H	0xFF10	/* PWM3T1计数高字节 */
#define	PWM3T1L	0xFF11	/* PWM3T1计数低字节 */
#define	PWM3T2H	0xFF12	/* PWM3T2计数高字节 */
#define	PWM3T2L	0xFF13	/* PWM3T2计数低字节 */
#define	PWM3CR	0xFF14	/* PWM3控制         */

#define	PWM4T1H	0xFF20	/* PWM4T1计数高字节 */
#define	PWM4T1L	0xFF21	/* PWM4T1计数低字节 */
#define	PWM4T2H	0xFF22	/* PWM4T2计数高字节 */
#define	PWM4T2L	0xFF23	/* PWM4T2计数低字节 */
#define	PWM4CR	0xFF24	/* PWM4控制         */

#define	PWM5T1H	0xFF30	/* PWM5T1计数高字节 */
#define	PWM5T1L	0xFF31	/* PWM5T1计数低字节 */
#define	PWM5T2H	0xFF32	/* PWM5T2计数高字节 */
#define	PWM5T2L	0xFF33	/* PWM5T2计数低字节 */
#define	PWM5CR	0xFF34	/* PWM5控制         */

#define	PWM6T1H	0xFF40	/* PWM6T1计数高字节 */
#define	PWM6T1L	0xFF41	/* PWM6T1计数低字节 */
#define	PWM6T2H	0xFF42	/* PWM6T2计数高字节 */
#define	PWM6T2L	0xFF43	/* PWM6T2计数低字节 */
#define	PWM6CR	0xFF44	/* PWM6控制         */

#define	PWM7T1H	0xFF50	/* PWM7T1计数高字节 */
#define	PWM7T1L	0xFF51	/* PWM7T1计数低字节 */
#define	PWM7T2H	0xFF52	/* PWM7T2计数高字节 */
#define	PWM7T2L	0xFF53	/* PWM7T2计数低字节 */
#define	PWM7CR	0xFF54	/* PWM7控制         */

#define	PWM2_ID		0
#define	PWM3_ID		1
#define	PWM4_ID		2
#define	PWM5_ID		3
#define	PWM6_ID		4
#define	PWM7_ID		5

#define	PwmClk_1T	0
#define	PwmClk_2T	1
#define	PwmClk_3T	2
#define	PwmClk_4T	3
#define	PwmClk_5T	4
#define	PwmClk_6T	5
#define	PwmClk_7T	6
#define	PwmClk_8T	7
#define	PwmClk_9T	8
#define	PwmClk_10T	9
#define	PwmClk_11T	10
#define	PwmClk_12T	11
#define	PwmClk_13T	12
#define	PwmClk_14T	13
#define	PwmClk_15T	14
#define	PwmClk_16T	15
#define	PwmClk_T2	16

//                    7   6   5   4     3        2       1        0      Reset Value
//PWMnCR:  PWMn控制   -   -   -   -   PWMn_PS  EPWMnI  ECnT2SI  ECnT1SI   0000,0000
#define	PWMn_PS_1		0x00	/* PWM管脚选择位 */
#define	PWMn_PS_2		0x08	/* PWM管脚选择位 */
#define	EPWMnI_Enable	0x04	/* 允许PWM中断   */
#define	ECnT2SI_Enable	0x02	/* 允许T2翻转时中断 */
#define	ECnT1SI_Enable	0x01	/* 允许T1翻转时中断 */

#define	PWM2_P37	0x00
#define	PWM2_P27	0x08
#define	PWM3_P21	0x00
#define	PWM3_P45	0x08
#define	PWM4_P22	0x00
#define	PWM4_P44	0x08
#define	PWM5_P23	0x00
#define	PWM5_P42	0x08
#define	PWM6_P16	0x00
#define	PWM6_P07	0x08
#define	PWM7_P17	0x00
#define	PWM7_P06	0x08

#define	EAXSFR()		P_SW2 |=  0x80	/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
#define	EAXRAM()		P_SW2 &= ~0x80	/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */
#define	C2INI	0x01	/* PWM输出端口的初始电平为高电平 */
#define	C3INI	0x02
#define	C4INI	0x04
#define	C5INI	0x08
#define	C6INI	0x10
#define	C7INI	0x20
#define	CBTADC	0x40	/* PWM计数器归零时自动触发ADC转换。（注：前提条件是PWM和ADC必须被使能，即ENPWM==1，且ADCON==1） */

#define	ENPWM	0x80	/* 使能PWM波形发生器，PWM计数器开始计数 */
#define	ECBI	0x40	/* 使能PWM计数器归零中断 */
#define	ENC7O	0x20	/* 相应PWM通道的端口设置为PWM输出口，受PWM波形发生器控制 */
#define	ENC6O	0x10
#define	ENC5O	0x08
#define	ENC4O	0x04
#define	ENC3O	0x02
#define	ENC2O	0x01
#define	PWM_Enable()	PWMCR |=  0x80	/* 使能PWM波形发生器，PWM计数器开始计数 */
#define	PWM_Disable()	PWMCR &= ~0x80	/* 关闭PWM波形发生器 */

#define	CBIF	0x40	/* PWM计数器归零中断标志位 */
#define	C7IF	0x20
#define	C6IF	0x10	/* 第n通道的PWM中断标志位 */
#define	C5IF	0x08
#define	C4IF	0x04
#define	C3IF	0x02
#define	C2IF	0x01

#define	ENFD		0x20	/* 使能PWM的外部异常检测功 */
#define	FLTFLIO		0x10	/* 发生WM外部异常时，PWM的输出口立即被设置为高阻输入模式。（注：只有ENCnO==1所对应的端口才会被强制悬空） */
#define	EFDI		0x08	/* 使能PWM异常检测中断 */
#define	FDCMP		0x04	/* 当比较器的输出由低变高时，触发PWM异常 */
#define	FDIO		0x02	/* 当P2.4的电平由低变高时，触发PWM异常 */
#define	FDIF		0x01	/* 当发生PWM异常（比较器的输出由低变高或者P2.4的电平由低变高）时，硬件自动将此位置1, 并置位中断标志.需要软件清零 */
#define	PWM_FaultDetect_Enable()	PWMFDCR |=  0x20		/* 使能PWM的外部异常检测功能 */
#define	PWM_FaultDetect_Disable()	PWMFDCR &= ~0x20		/* 禁止PWM的外部异常检测功能 */


/*  BIT Registers  */
/*  PSW   */
sbit CY   = PSW^7;
sbit AC   = PSW^6;
sbit F0   = PSW^5;
sbit RS1  = PSW^4;
sbit RS0  = PSW^3;
sbit OV   = PSW^2;
sbit F1   = PSW^1;
sbit P    = PSW^0;

